Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོ་དུང་ཡང་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲིའི་འཁོར་དང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་རབ་ཏུ་འབྱུང་བའི་རྗེས་སུ་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: King Śaṅkha will, along with his attendants, eighty thousand minor kings, also go forth, following the Supremely Perfectly Awakened One Maitreya who himself went forth.

source: །དེའི་ཆུང་མ་རིན་པོ་ཆེ་ས་ག་ཞེས་བྱ་བ་ཡང་བུད་མེད་བརྒྱད་ཁྲིའི་འཁོར་དང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་རབ་ཏུ་འབྱུང་བའི་རྗེས་སུ་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: His precious woman, Viśākhā, will also go forth along with her eighty thousand female attendants, following the Supremely Perfectly Awakened One Maitreya who himself went forth.

source: །བྲམ་ཟེ་ཚངས་པའི་ཚེ་ཡང་བྲམ་ཟེའི་ཁྱེའུ་བརྒྱད་ཁྲིའི་འཁོར་དང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་རབ་ཏུ་འབྱུང་བའི་རྗེས་སུ་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: The brahmin Brahmāyus will also go forth along with his attendants, the eighty thousand young brahmins, following the Supremely Perfectly Awakened One Maitreya who himself went forth.

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་འཁོར་དགེ་སློང་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་དང་རི་བྱ་གག་རྐང་གང་ན་བ་དེར་གཤེགས་པར་འགྱུར་རོ།
en: “Thereupon the Perfectly Awakened One Maitreya, surrounded by ninety-six hundred thousand monks, will go to Mount Kukkuṭapādaka.

source: །དེ་ན་དགེ་སློང་འོད་སྲུང་གི་རུས་པའི་ཚོགས་མ་ཞིག་པ་འདུག་པས་རི་བྱ་གག་རྐང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་ལ་ཁ་དབྱེ་བར་འགྱུར་རོ།
en: Because the whole skeleton of the monk Kāśyapa will be there in the mountain, Mount Kukkuṭapādaka will open itself for the Supremely Perfectly Awakened One Maitreya.

source: །དེ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པས་དགེ་སློང་འོད་སྲུང་གི་རུས་པའི་ཚོགས་མ་ཞིག་པ་ཕྱག་གཡས་པས་བླངས་ནས་ཕྱག་གཡོན་པར་བཞག་སྟེ་ཉན་ཐོས་རྣམས་ལ་འདི་སྐད་ཅེས།
en: Then the Supremely Perfectly Awakened One Maitreya will take the whole skeleton of the monk Kāśyapa with his right hand, place it in his left hand, and teach the Dharma to his disciples:

source: དགེ་སློང་དག་སྐྱེ་དགུ་རྣམས་ཀྱི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་སྟོན་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་བ་དེའི་ཉན་ཐོས་རྣམས་ལས་ཆོག་ཤེས་པ་དང་འདོད་པ་ཆུང་བ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ནི་འོད་སྲུང་ཡིན་ནོ་ཞེས་བསྟན་པ་གང་ཡིན་པ་དེ་ནི་འདི་ཡིན་ཏེ།
en: ‘Monks, when the human lifespan was a hundred years, there appeared in the world a teacher called Śākyamuni. Among his disciples, Kāśyapa was said to have been the one who was the best at being content with what he had, being free from avarice, and accomplishing the ascetic practices. He is here.

source: ཤཱཀྱ་ཐུབ་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེའི་བསྟན་པ་ཡང་འདིས་ཡང་དག་པར་བསྡུས་སོ་ཞེས་ཆོས་སྟོན་པར་འགྱུར་རོ།
en: Moreover, after Śākyamuni was completely emancipated, his teachings were collected by this Kāśyapa.’

source: །དེ་རྣམས་ཀྱིས་མཐོང་ནས་སྐྱོ་བ་སྐྱེས་ཏེ། འདི་འདྲ་བའི་ལུས་ཀྱིས་ཇི་ལྟར་འདི་ལྟ་བུའི་ཡོན་ཏན་གྱི་ཚོགས་ཐོབ་པར་གྱུར་སྙམ་ནས་དེ་རྣམས་སྐྱོ་བ་དེ་ཉིད་ཀྱིས་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེ། འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་དགྲ་བཅོམ་པ་ཉིད་དང་། སྦྱངས་པའི་ཡོན་ཏན་མངོན་དུ་བྱ་བ་ལ་བརྩོན་པར་འགྱུར་རོ།
en: “The monks will see the skeleton and experience grief, thinking, ‘How could such a number of good qualities be attained with such a body?’ Through the experience of grief they will actualize the state of an arhat—the ninety-six hundred thousand monks will actualize the state of an arhat and the ascetic practices.

source: །མཆོད་སྡོང་དེ་ནི་དེར་ཞིག་པར་འགྱུར་རོ།
en: Then the pillar will be destroyed.” D.

source: །བཙུན་པ་རྒྱུ་གང་དང་རྐྱེན་གང་གིས་དཀོན་མཆོག་གཉིས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ལགས།
en: The Former Lives of the Buddha Maitreya and the Wheel-Turning King Śaṅkha “O Honored One, by what cause and what condition do the two treasures (a wheel-turning king and a buddha) appear in the world?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྨོན་ལམ་གྱི་དབང་གིས་སོ།
en: “It is by the power of an aspiration,” replied the Blessed One.

source: །བཅོམ་ལྡན་འདས་གང་དུ་སྨོན་ལམ་བཏབ་ལགས།
en: “O Blessed One, where did you make such an aspiration?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་ཡུལ་དབུས་སུ་རྒྱལ་པོ་གོས་སྦྱིན་ཞེས་བྱ་བ་འབྱོར་པ་དང་། རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་། མི་མང་པོས་རབ་ཏུ་གང་བ་ན་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: “Monks, once there was a king named Vāsava in the midland region. He ruled over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people.

source: །དེའི་ཤིང་རྣམས་མེ་ཏོག་དང་འབྲས་བུ་རྟག་པ་དང་། ལྷས་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་ཕབ་པས་ལྷག་པར་ལོ་ཏོག་རྣམས་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ།
en: His trees were always full of blossoms and fruits, and the gods brought rain at the appropriate times. Therefore, the harvest was exceedingly abundant.

source: །བྱང་ཕྱོགས་ན་རྒྱལ་པོ་ནོར་ལྡན་ཞེས་བྱ་བ་འབྱོར་པ་དང་། རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་། མི་མང་པོས་རབ་ཏུ་གང་བ་ན་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: “In the northern region, there was a king named Dhanasaṃmata. He ruled over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people.

source: །དེ་དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་གོས་སྦྱིན་གྱི་མདུན་ན་འདོན་ལས་ཁྱེའུ་སྤྱི་གཙུག་རིན་པོ་ཆེས་བརྒྱན་པ་ཞིག་བཙས་ཏེ།
en: “One day King Vāsava’s chief priest had a son whose crest (śikhā) was naturally ornamented with jewels (ratna).

source: དེའི་བཙས་སྟོན་རྒྱ་ཆེར་བྱས་ནས་དེའི་མིང་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཞེས་བཏགས་སོ། །དེ་དུས་གཞན་ཞིག་ན་རྒ་བ་དང་ན་བ་དང་འཆི་བ་ཡང་དག་པར་མཐོང་ནས་སྐྱོ་བ་སྐྱེས་ཏེ་ནགས་སུ་སོང་ངོ་།
en: A great celebration at the boy’s birth was held and he was named Ratnaśikhin. Later, having seen the old, the sick, and the dead, he experienced grief and went to the forest.

source: །གང་གི་ཉི་མ་ཁོ་ན་ལ་ནགས་སུ་སོང་བ་དེ་ཁོ་ནའི་ཉི་མ་ལ་དེས་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་ནས་དེའི་མིང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: On the very day when he went to the forest, he attained supreme knowledge, and his name became the Perfectly Awakened One Ratnaśikhin.

source: །དེ་ནས་དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་ནོར་ལྡན་སྟེང་གི་ཁང་བཟངས་ཀྱི་གཞིར་སོང་སྟེ་བློན་པོའི་ཚོགས་ཀྱིས་བསྐོར་ནས་འདུག་གོ།
en: “Then one day King Dhanasaṃmata was sitting on a terrace made of jewels, surrounded by his ministers.

source: །དེས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་ངའི་ཅི་འདྲ་བ་དེ་ལྟར་རྒྱལ་པོ་གཞན་འགའི་ཡུལ་ན་འབྱོར་པ་དང་། རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་མི་མང་པོས་རབ་ཏུ་གང་བ་དང་། ཤིང་རྣམས་མེ་ཏོག་དང་འབྲས་བུ་རྟག་པ་དང་། ལྷས་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་བབ་པས་ལོ་ཏོག་རྣམས་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་ལྟ་ཡོད་དམ།
en: He asked the ministers, ‘Sirs, is there any other king like me, whose land is rich, prosperous, peaceful, abundant in food, and full of many people, and in whose land trees are always full of blossoms and fruits, and the gods bring rain at the appropriate times, and therefore the harvest is exceedingly abundant?’

source: ཡུལ་དབུས་ནས་ཚོང་པ་ཟོང་ཐོགས་ཏེ་བྱང་ཕྱོགས་སུ་འོངས་པ་དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཡུལ་དབུས་ན་རྒྱལ་པོ་གོས་སྦྱིན་ཞེས་བྱ་བ་ཞིག་མཆིས་སོ།
en: “People who had come from the midland region to the northern region bearing merchandise said, ‘Your Majesty, there is a king named Vāsava in the midland region.’

source: །རྒྱལ་པོ་ནོར་ལྡན་གྱིས་ཐོས་མ་ཐག་ཏུ་མི་བཟོད་པ་ཆེན་པོ་སྐྱེས་ཏེ།
en: “As soon as he heard this, King Dhanasaṃmata found it unbearable.

source: དེ་མི་བཟོད་པ་སྐྱེས་ནས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་སྐོན་ཅིག་དང་ཡུལ་འཁོར་གཞོམ་པར་བྱའོ།
en: Unable to bear it, he ordered his ministers, ‘Sirs, prepare an army consisting of four divisions. I will destroy his land.’

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེའི་ཚོགས་དང་རྟ་པའི་ཚོགས་དང་ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་དབུས་སུ་དོང་ནས་ཆུ་བོ་གང་གཱའི་ལྷོ་ཕྱོགས་ཀྱི་འགྲམ་དུ་འཁོད་དོ།
en: “Then King Dhanasaṃmata, having prepared an army consisting of four divisions, namely, an elephant division, a horse division, a chariot division, and an infantry division, went to the midland region and took up his position on the south bank of the Ganges.

source: །རྒྱལ་པོ་གོས་སྦྱིན་གྱིས་རྒྱལ་པོ་ནོར་ལྡན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེའི་ཚོགས་དང་རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ནས་ཡུལ་དབུས་སུ་འོངས་ཏེ་ཆུ་བོ་གང་གཱའི་ལྷོ་ཕྱོགས་ཀྱི་འགྲམ་ན་འཁོད་དོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དེས་ཀྱང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་ཤིང་རྟ་པའི་ཚོགས་དང་དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ནས་ཆུ་བོ་གང་གཱའི་བྱང་ཕྱོགས་ལོགས་ཀྱི་འགྲམ་ན་འདུག་གོ།
en: “When King Vāsava heard that King Dhanasaṃmata had prepared an army consisting of four divisions, namely, an elephant division, a horse division, a chariot division, and an infantry division, and that he had come to the midland region and taken up his position on the south bank of the Ganges, he also prepared an army consisting of four divisions, namely, an elephant division, a horse division, a chariot division, and an infantry division, and took up his position on the north bank of the Ganges.

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་དེ་གཉིས་ཀྱི་གདུལ་པའི་དུས་མཁྱེན་ནས་ཆུ་བོ་གང་གཱའི་འགྲམ་དུ་ནུབ་མོ་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ།
en: “The Perfectly Awakened One Ratnaśikhin knew that it was the right time to train these two kings and stayed overnight on the bank of the Ganges.

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་དོ།
en: Then the Perfectly Awakened One Ratnaśikhin entertained mundane thoughts.

source: །ཆོས་ཉིད་ཀྱིས་གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་པ་དེའི་ཚེ་བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པའི་ལྷ་རྣམས་ཀྱི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དགོངས་པ་ཤེས་པར་འགྱུར་རོ།
en: It naturally occurs that when the buddhas, the blessed ones, entertain mundane thoughts, Śakra, Brahmā, and the other gods understand the Blessed One’s thoughts.

source: །དེ་ནས་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པ་ལྷ་རྣམས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then Śakra, Brahmā, and the other gods went to the Perfectly Awakened One Ratnaśikhin.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: Upon their arrival, they bowed low until their foreheads touched the feet of the Perfectly Awakened One Ratnaśikhin, and then they sat down to one side.

source: དེ་རྣམས་ཀྱི་ཁ་དོག་གི་མཐུས་སྣང་བ་རྒྱ་ཆེན་པོ་བྱུང་བར་གྱུར་པ་རྒྱལ་པོ་ནོར་ལྡན་གྱིས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་དྲིས་པ། ཤེས་ལྡན་དག་རྒྱལ་པོ་གོས་སྦྱིན་གྱི་ཡུལ་ན་སྣང་བ་རྒྱ་ཆེན་པོ་བྱུང་བ་འདི་ཅི་ཡིན།
en: “King Dhanasaṃmata saw the vast splendor of light created by the figures of the gods, and he asked his ministers, ‘Sirs, what is this vast splendor of light that has appeared in the land of King Vāsava?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་རྒྱལ་པོ་གོས་སྦྱིན་གྱི་ཡུལ་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་བྱུང་སྟེ།
en: “ ‘Your Majesty,’ they answered, ‘the Perfectly Awakened One Ratnaśikhin has appeared in the land of King Vāsava.

source: དེ་ལ་བལྟ་བའི་ཕྱིར་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པ་མཆིས་པ་དེས་ན་སྣང་བ་ཆེན་པོ་འདི་བྱུང་སྟེ།
en: Śakra, Brahmā, and the other gods have come to see him. Therefore, a vast splendor of light has appeared.

source: དེ་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ལགས་པས་འདི་ནི་དེའི་མཐུ་ལགས་སོ།
en: He is of great magical power and dignity, and the splendor of light is his dignity.’

source: །རྒྱལ་པོ་ནོར་ལྡན་གྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་གང་གི་ཡུལ་དུ་གང་ལ་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པ་ཡང་བལྟ་བའི་ཕྱིར་འོང་བའི་རྐང་གཉིས་བསོད་ནམས་ཀྱི་ཞིང་དེ་ལྟ་བུ་བྱུང་བ་དེ་ལ་བདག་གིས་གནོད་པ་ཅི་འདྲ་བ་ཞིག་བྱ་ཞེས། དེས་དེ་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: “King Dhanasaṃmata then asked, ‘Sirs, what harm can I do to a king in whose land has appeared a human field of merit such as is visited even by Śakra, Brahmā, and the other gods?’

source: གྲོགས་པོ་ཁྱོད་དེ་ལ་བདག་ཅུང་ཟད་ཀྱང་མི་བྱེད་ཀྱིས་ཚུར་སྤྱོན།
en: “He sent a messenger to King Vāsava, saying, ‘O my friend, I will not do anything against you.

source: ཁྱོད་ནི་བསོད་ནམས་ཀྱི་མཐུ་ཆེན་པོ་ཅན་ཞིག་པས་ཁྱོད་ཀྱི་ཡུལ་ན་གང་ལ་བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་ཡང་བལྟ་བའི་ཕྱིར་འོང་བ་རྐང་གཉིས་བསོད་ནམས་ཀྱི་ཞིང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་བཞུགས་སོ།
en: Come here. You are a man with the great power of merit, and in your land is a human field of merit, the Perfectly Awakened One Ratnaśikhin, who is visited by Śakra, Brahmā, and the other gods.

source: །འོན་ཀྱང་ཁྱོད་ཀྱི་མགུལ་ནས་འཁྱུད་ནས་འགྲོ་བར་བྱ་སྟེ། དེ་ལྟ་ན་བདག་ཅག་ཕན་ཚུན་ཡིད་བདེ་བར་འགྱུར་རོ་ཞེས་སྤྲིང་ངོ་།
en: I would rather clasp you around the neck and leave so that we will be content with one another.’

source: །རྒྱལ་པོ་གོས་སྦྱིན་ཡིད་མ་ཆེས་ནས་དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “King Vāsava did not trust him. He went to the Perfectly Awakened One Ratnaśikhin.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When he arrived, he bowed low until his forehead touched the feet of the Perfectly Awakened One Ratnaśikhin, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་གོས་སྦྱིན་གྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལ་རྒྱལ་པོ་ནོར་ལྡན་གྱིས་སྤྲིང་པ།
en: When he had sat down to one side, King Vāsava told the Perfectly Awakened One Ratnaśikhin, ‘O Honored One, King Dhanasaṃmata sent me a message:

source: གྲོགས་པོ་སྡུག་པ་ཁྱོད་ལ་བདག་ཅག་ཅི་ཡང་མི་བྱེད་ཀྱིས་ཚུར་ཤོག །ཁྱོད་ཀྱི་མགུལ་བ་ནས་འཁྱུད་ནས་འགྲོ་བར་བྱ་སྟེ།
en: “O my friend, I will not do anything against you. Come here.

source: དེ་ལྟ་ན་བདག་ཅག་ཕན་ཚུན་ཡིད་བདེ་བར་འགྱུར་རོ་ཞེས་མཆི་ན་དེ་ལ་བདག་གིས་ཇི་ལྟར་བསྒྲུབ་པར་བགྱི།
en: I would rather clasp you around the neck and leave so that we will be content with one another.” What should I do about this?’

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སོང་ཤིག་དང་ཁྱོད་ལ་ལེགས་པར་འགྱུར་རོ།
en: “ ‘Great King,’ said the Perfectly Awakened One Ratnaśikhin, ‘go there and it will be good for you.’

source: །བཅོམ་ལྡན་འདས་ཅི་བདག་གིས་དེའི་རྐང་པ་གཉིས་ལ་གཏུག་པར་བགྱིའམ།
en: “‘Blessed One, should I throw myself at his feet?’

source: རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་དཔུང་ཆེན་པོ་རྣམས་ལ་ནི་གཏུག་པར་བྱ་དགོས་སོ། །དེ་ནས་རྒྱལ་པོ་གོས་སྦྱིན་སྟན་ལས་ལངས་ཏེ།
en: “‘Great King, you must throw yourself at the feet of kings who have a great army.’ “King Vāsava then rose from his seat, bowed low until his forehead touched the feet of the Perfectly Awakened One Ratnaśikhin, and departed.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་ཆས་ཏེ་རྒྱལ་པོ་ནོར་ལྡན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་ནོར་ལྡན་གྱི་རྐང་པ་གཉིས་ལ་གཏུགས་སོ།
en: He went to King Dhanasaṃmata, and when he arrived, he threw himself at King Dhanasaṃmata’s feet.

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་གྱིས་མགུལ་ནས་འཁྱུད་དེ་ཡིད་གཅུགས་པར་བྱས་ཏེ་བཏང་ངོ་།
en: King Dhanasaṃmata then clasped him around the neck, made peace with him, and departed.

source: །དེ་ནས་རྒྱལ་པོ་གོས་སྦྱིན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Thereupon King Vāsava went to the Perfectly Awakened One Ratnaśikhin.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། རྒྱལ་པོ་གོས་སྦྱིན་གྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་རྒྱལ་པོ་ཐམས་ཅད་ཀྱིས་རྐང་པ་གཉིས་ལ་གཏུགས་པའི་རྒྱལ་པོ་གང་ལགས།
en: When he had sat down to one side, King Vāsava asked the Perfectly Awakened One Ratnaśikhin, ‘Honored One, who is the king at whose feet every king throws himself?’

source: རྒྱལ་པོ་ཆེན་པོ་འཁོར་ལོས་སྒྱུར་བ་ཡིན་ནོ།
en: “‘Great King, it is the wheel-turning king.’

source: །དེ་ནས་རྒྱལ་པོ་གོས་སྦྱིན་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: “ King Vāsava then rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Perfectly Awakened One Ratnaśikhin, and said to him, ‘May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.’

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་རྒྱལ་པོ་གོས་སྦྱིན་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: “The Perfectly Awakened One Ratnaśikhin assented to King Vāsava by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་གོས་སྦྱིན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་སྤྱན་སྔ་ནས་དོང་ངོ་།
en: Then King Vāsava, knowing that the Perfectly Awakened One Ratnaśikhin had assented by remaining silent, departed from the presence of the Perfectly Awakened One Ratnaśikhin.

source: །དེ་ནས་རྒྱལ་པོ་གོས་སྦྱིན་གྱིས་དེ་ཉིད་ཀྱི་ནུབ་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་ཏེ།
en: Thereupon King Vāsava prepared a pure and fine meal during the night.

source: ནང་པར་སྔར་ལངས་ནས་གདན་བཤམས་ཏེ་ནོར་བུའི་ཆུ་སྣོད་བཞག་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་སྤྱན་འདྲེན་གྱིས་དུས་ཚོད་གསོལ་པ། བཙུན་པ་གདུགས་ཚོད་བཤམས་ལགས་ཤིང་མཆིས་ན།
en: The next morning he prepared seats, set up a jeweled pitcher, and let the Perfectly Awakened One Ratnaśikhin know the time by messenger:

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་སྔ་དྲོ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ཏེ། དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་གྱིས་བལྟས་ནས།
en: “Then, early in the morning, the Perfectly Awakened One Ratnaśikhin dressed, took his bowl and his robe, and, surrounded by a group of monks, went to the dining hall of King Vāsava, followed by the community of monks.

source: རྒྱལ་པོ་གོས་སྦྱིན་གྱི་བཀད་ས་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: When he arrived, he sat on the seat prepared for him in front of the community of monks.

source: །དེ་ནས་རྒྱལ་པོ་གོས་སྦྱིན་གྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དེ།
en: King Vāsava then knew that the community of monks headed by the Perfectly Awakened One Ratnaśikhin had sat down in comfort, and with his own hands he served and satisfied them with a pure and fine meal.

source: རྣམ་པ་དུ་མར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ། །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་གསོལ་ནས་ཕྱག་གཉིས་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞབས་གཉིས་ལ་གཏུགས་ཏེ་སྨོན་ལམ་གདབ་པར་བརྩམས་པ།
en: When, with his own hands, he had served and satisfied them in a variety of ways with a pure and fine meal, knowing that the Perfectly Awakened One Ratnaśikhin had finished his meal and washed his hands and his bowl, the king threw himself at the feet of the Perfectly Awakened One Ratnaśikhin and made this aspiration:

source: བཙུན་པ་སྦྱིན་པའི་དགེ་བའི་རྩ་བ་འདིས་བདག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཅིག་ཅེས་སྨྲས་ནས་དེ་མ་ཐག་ཏུ་དུང་ཡང་བུས་སོ།
en: ‘O Honored One, may I become a wheel-turning king by this root of merit from my offering.’ Soon after that, he also blew a conch shell (śaṅkha).

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་རྒྱལ་པོ་གོས་སྦྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དུང་ཞེས་བྱ་བར་འགྱུར་རོ།
en: “Then the Perfectly Awakened One Ratnaśikhin said to King Vāsava, ‘Great King, you will become a wheel-turning king named Śaṅkha when the human lifespan is eighty thousand years.’

source: །དེ་ནས་སྐད་ཆེན་པོའི་སྒྲ་དག་བྱུང་ངོ་།
en: “Then there was a loud shout.

source: །རྒྱལ་པོ་ནོར་ལྡན་གྱིས་ཅ་ཅོའི་སྒྲ་དག་ཐོས་ནས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་རྒྱལ་པོ་གོས་སྦྱིན་གྱི་ཡུལ་ན་ཅ་ཅོའི་སྒྲ་གྲག་པ་དེ་ཅི་ཞིག་ཡིན། དེ་རྣམས་ཀྱིས་ལེགས་པར་བརྟགས་ནས་སྨྲས་པ།
en: King Dhanasaṃmata heard the shout and asked his ministers, ‘Sirs, there was a shout in the land of King Vāsava. What was it?’

source: ལྷ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་རྒྱལ་པོ་གོས་སྦྱིན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་ལུང་བསྟན་པས་སྐྱེ་བོའི་ཚོགས་དགའ་བ་དང་། མགུ་བ་དང་རབ་ཏུ་དགའ་བས་དེས་ན་ཅ་ཅོའི་སྒྲ་གྲག་པ་ལགས་སོ།
en: “They investigated it carefully and answered, ‘Your Majesty, because the Perfectly Awakened One Ratnaśikhin predicted King Vāsava would become a wheel-turning king, the people were pleased and delighted and rejoiced. Hence there was a shout.’

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Thereupon King Dhanasaṃmata went to the Perfectly Awakened One Ratnaśikhin.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་ནོར་ལྡན་གྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་འཁོར་ལོས་སྒྱུར་བ་ཐམས་ཅད་ཀྱིས་རྐང་པ་གཉིས་ལ་གཏུག་པར་བགྱི་བ་གང་ལགས།
en: When he had sat down to one side, King Dhanasaṃmata asked the Perfectly Awakened One Ratnaśikhin, ‘O Honored One, at whose feet does every wheel-turning king throw himself?’

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡིན་ནོ།
en: “ ‘Great King, it is the Tathāgata, the Arhat, the Perfectly Awakened One.’

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: “ King Dhanasaṃmata then rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Perfectly Awakened One Ratnaśikhin, and said, ‘May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.’

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་རྒྱལ་པོ་ནོར་ལྡན་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: “The Perfectly Awakened One Ratnaśikhin assented to King Dhanasaṃmata by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Then King Dhanasaṃmata, knowing that the Perfectly Awakened One Ratnaśikhin had assented by remaining silent, bowed low until his forehead touched the feet of the Perfectly Awakened One Ratnaśikhin, and then departed from his presence.

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་གྱིས་དེ་ཉིད་ཀྱི་ནུབ་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་ནས་ནང་པར་སྔར་ལངས་ཏེ་གདན་བཤམས་ཤིང་ནོར་བུའི་ཆུ་སྣོད་བཞག་ནས།
en: Thereupon King Dhanasaṃmata prepared a pure and fine meal during the night.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་སྤྱན་འདྲེན་གྱིས་དུས་ཚོད་གསོལ་པ།
en: After he rose at dawn, he prepared seats, set up a jeweled pitcher, and let the Perfectly Awakened One Ratnaśikhin know the time by messenger:

source: བཙུན་པ་གདུགས་ཚོད་བཤམས་ལགས་ཤིང་མཆིས་ན་བཅོམ་ལྡན་འདས་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་སུ་གསོལ།
en: ‘O Honored One, the time has arrived. May the Blessed One know that the meal is ready.’

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་སྔ་དྲོ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ཏེ། དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་གྱིས་བལྟས་ཏེ་རྒྱལ་པོ་ནོར་ལྡན་གྱི་བཀད་ས་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས།
en: “Then, early in the morning, the Perfectly Awakened One Ratnaśikhin dressed, took his bowl and his robe, and, surrounded by a group of monks, went to the dining hall of King Dhanasaṃmata, followed by the community of monks.

source: དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: When he arrived, he sat on the seat prepared for him in front of the community of monks.
